"use client";

import { Image } from "@heroui/image";
import NextLink from "next/link";
import { ROUTES } from "../routes";

const policyText = `
Политика в\u00a0отношении обработки персональных данных
1. Общие положения
Настоящая политика обработки персональных данных составлена в\u00a0соответствии с\u00a0требованиями Федерального закона от\u00a027.07.2006. №\u00a0152-ФЗ «О\u00a0персональных данных» (далее\u00a0— Закон о\u00a0персональных данных) и\u00a0определяет порядок обработки персональных данных и\u00a0меры по\u00a0обеспечению безопасности персональных данных, предпринимаемые Freaks 4U Gaming GmbH (далее\u00a0— Оператор). 
1.1. Оператор ставит своей важнейшей целью и\u00a0условием осуществления своей деятельности соблюдение прав и\u00a0свобод человека и\u00a0гражданина при обработке его персональных данных, в\u00a0том числе защиты прав на\u00a0неприкосновенность частной жизни, личную и\u00a0семейную тайну. 
1.2. Настоящая политика Оператора в\u00a0отношении обработки персональных данных (далее\u00a0— Политика) применяется ко\u00a0всей информации, которую Оператор может получить о\u00a0посетителях веб-сайта https://blow.ru. 
2. Основные понятия, используемые в\u00a0Политике
2.1. Автоматизированная обработка персональных данных — обработка персональных данных с\u00a0помощью средств вычислительной техники. 
2.2. Блокирование персональных данных — временное прекращение обработки персональных данных (за\u00a0исключением случаев, если обработка необходима для уточнения персональных данных). 
2.3. Веб-сайт — совокупность графических и\u00a0информационных материалов, а\u00a0также программ для ЭВМ и\u00a0баз данных, обеспечивающих их\u00a0доступность в\u00a0сети интернет по\u00a0сетевому адресу https://blow.ru. 
2.4. Информационная система персональных данных — совокупность содержащихся в\u00a0базах данных персональных данных и\u00a0обеспечивающих их\u00a0обработку информационных технологий и\u00a0технических средств. 
2.5. Обезличивание персональных данных — действия, в\u00a0результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных. 
2.6. Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с\u00a0использованием средств автоматизации или без использования таких средств с\u00a0персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных. 
2.7. Оператор — государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с\u00a0другими лицами организующие и/или осуществляющие обработку персональных данных, а\u00a0также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с\u00a0персональными данными. 
2.8. Персональные данные — любая информация, относящаяся прямо или косвенно к\u00a0определенному или определяемому Пользователю веб-сайта https://blow.ru. 
2.9. Персональные данные, разрешенные субъектом персональных данных для распространения, — персональные данные, доступ неограниченного круга лиц к\u00a0которым предоставлен субъектом персональных данных путем дачи согласия на\u00a0обработку персональных данных, разрешенных субъектом персональных данных для распространения в\u00a0порядке, предусмотренном Законом о\u00a0персональных данных (далее\u00a0— персональные данные, разрешенные для распространения). 
2.10. Пользователь — любой посетитель веб-сайта https://blow.ru. 
2.11. Предоставление персональных данных — действия, направленные на\u00a0раскрытие персональных данных определенному лицу или определенному кругу лиц. 
2.12. Распространение персональных данных — любые действия, направленные на\u00a0раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на\u00a0ознакомление с\u00a0персональными данными неограниченного круга лиц, в\u00a0том числе обнародование персональных данных в\u00a0средствах массовой информации, размещение в\u00a0информационно-телекоммуникационных сетях или предоставление доступа к\u00a0персональным данным каким-либо иным способом. 
2.13. Трансграничная передача персональных данных — передача персональных данных на\u00a0территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу. 
2.14. Уничтожение персональных данных — любые действия, в\u00a0результате которых персональные данные уничтожаются безвозвратно с\u00a0невозможностью дальнейшего восстановления содержания персональных данных в\u00a0информационной системе персональных данных и/или уничтожаются материальные носители персональных данных. 
3. Основные права и\u00a0обязанности Оператора
3.1. Оператор имеет право:
— получать от\u00a0субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные; 
— в\u00a0случае отзыва субъектом персональных данных согласия на\u00a0обработку персональных данных, а\u00a0также, направления обращения с\u00a0требованием о\u00a0прекращении обработки персональных данных, Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в\u00a0Законе о\u00a0персональных данных; 
— самостоятельно определять состав и\u00a0перечень мер, необходимых и\u00a0достаточных для обеспечения выполнения обязанностей, предусмотренных Законом о\u00a0персональных данных и\u00a0принятыми в\u00a0соответствии с\u00a0ним нормативными правовыми актами, если иное не\u00a0предусмотрено Законом о\u00a0персональных данных или другими федеральными законами. 
3.2. Оператор обязан:
— предоставлять субъекту персональных данных по\u00a0его просьбе информацию, касающуюся обработки его персональных данных; 
— организовывать обработку персональных данных в\u00a0порядке, установленном действующим законодательством РФ; 
— отвечать на\u00a0обращения и\u00a0запросы субъектов персональных данных и\u00a0их\u00a0законных представителей в\u00a0соответствии с\u00a0требованиями Закона о\u00a0персональных данных; 
— сообщать в\u00a0уполномоченный орган по\u00a0защите прав субъектов персональных данных по\u00a0запросу этого органа необходимую информацию в\u00a0течение 10\u00a0дней с\u00a0даты получения такого запроса; 
— публиковать или иным образом обеспечивать неограниченный доступ к\u00a0настоящей Политике в\u00a0отношении обработки персональных данных; 
— принимать правовые, организационные и\u00a0технические меры для защиты персональных данных от\u00a0неправомерного или случайного доступа к\u00a0ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а\u00a0также от\u00a0иных неправомерных действий в\u00a0отношении персональных данных; 
— прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и\u00a0уничтожить персональные данные в\u00a0порядке и\u00a0случаях, предусмотренных Законом о\u00a0персональных данных; 
— исполнять иные обязанности, предусмотренные Законом о\u00a0персональных данных. 
4. Основные права и\u00a0обязанности субъектов персональных данных
4.1. Субъекты персональных данных имеют право:
— получать информацию, касающуюся обработки его персональных данных, за\u00a0исключением случаев, предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором в\u00a0доступной форме, и\u00a0в\u00a0них не\u00a0должны содержаться персональные данные, относящиеся к\u00a0другим субъектам персональных данных, за\u00a0исключением случаев, когда имеются законные основания для раскрытия таких персональных данных. Перечень информации и\u00a0порядок ее\u00a0получения установлен Законом о\u00a0персональных данных; 
— требовать от\u00a0оператора уточнения его персональных данных, их\u00a0блокирования или уничтожения в\u00a0случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не\u00a0являются необходимыми для заявленной цели обработки, а\u00a0также принимать предусмотренные законом меры по\u00a0защите своих прав; 
— выдвигать условие предварительного согласия при обработке персональных данных в\u00a0целях продвижения на\u00a0рынке товаров, работ и\u00a0услуг; 
— на\u00a0отзыв согласия на\u00a0обработку персональных данных, а\u00a0также, на\u00a0направление требования о\u00a0прекращении обработки персональных данных; 
— обжаловать в\u00a0уполномоченный орган по\u00a0защите прав субъектов персональных данных или в\u00a0судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных; 
— на\u00a0осуществление иных прав, предусмотренных законодательством РФ. 
4.2. Субъекты персональных данных обязаны:
— предоставлять Оператору достоверные данные о\u00a0себе; 
— сообщать Оператору об\u00a0уточнении (обновлении, изменении) своих персональных данных. 
4.3. Лица, передавшие Оператору недостоверные сведения о\u00a0себе, либо сведения о\u00a0другом субъекте персональных данных без согласия последнего, несут ответственность в\u00a0соответствии с\u00a0законодательством РФ. 
5. Принципы обработки персональных данных
5.1. Обработка персональных данных осуществляется на\u00a0законной и\u00a0справедливой основе. 
5.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и\u00a0законных целей. Не\u00a0допускается обработка персональных данных, несовместимая с\u00a0целями сбора персональных данных. 
5.3. Не\u00a0допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в\u00a0целях, несовместимых между собой. 
5.4. Обработке подлежат только персональные данные, которые отвечают целям их\u00a0обработки. 
5.5. Содержание и\u00a0объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не\u00a0допускается избыточность обрабатываемых персональных данных по\u00a0отношению к\u00a0заявленным целям их\u00a0обработки. 
5.6. При обработке персональных данных обеспечивается точность персональных данных, их\u00a0достаточность, а\u00a0в\u00a0необходимых случаях и\u00a0актуальность по\u00a0отношению к\u00a0целям обработки персональных данных. Оператор принимает необходимые меры и/или\u00a0обеспечивает их\u00a0принятие по\u00a0удалению или уточнению неполных или неточных данных. 
5.7. Хранение персональных данных осуществляется в\u00a0форме, позволяющей определить субъекта персональных данных, не\u00a0дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не\u00a0установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по\u00a0которому является субъект персональных данных. Обрабатываемые персональные данные уничтожаются либо обезличиваются по\u00a0достижении целей обработки или в\u00a0случае утраты необходимости в\u00a0достижении этих целей, если иное не\u00a0предусмотрено федеральным законом. 
6. Цели обработки персональных данных

7. Условия обработки персональных данных
7.1. Обработка персональных данных осуществляется с\u00a0согласия субъекта персональных данных на\u00a0обработку его персональных данных. 
7.2. Обработка персональных данных необходима для достижения целей, предусмотренных международным договором Российской Федерации или законом, для осуществления возложенных законодательством Российской Федерации на\u00a0оператора функций, полномочий и\u00a0обязанностей. 
7.3. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта другого органа или должностного лица, подлежащих исполнению в\u00a0соответствии с\u00a0законодательством Российской Федерации об\u00a0исполнительном производстве. 
7.4. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем по\u00a0которому является субъект персональных данных, а\u00a0также для заключения договора по\u00a0инициативе субъекта персональных данных или договора, по\u00a0которому субъект персональных данных будет являться выгодоприобретателем или поручителем. 
7.5. Обработка персональных данных необходима для осуществления прав и\u00a0законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не\u00a0нарушаются права и\u00a0свободы субъекта персональных данных. 
7.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к\u00a0которым предоставлен субъектом персональных данных либо по\u00a0его просьбе (далее\u00a0— общедоступные персональные данные). 
7.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в\u00a0соответствии с\u00a0федеральным законом. 
8. Порядок сбора, хранения, передачи и\u00a0других видов обработки персональных данных 
Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и\u00a0технических мер, необходимых для выполнения в\u00a0полном объеме требований действующего законодательства в\u00a0области защиты персональных данных. 
8.1. Оператор обеспечивает сохранность персональных данных и\u00a0принимает все возможные меры, исключающие доступ к\u00a0персональным данным неуполномоченных лиц. 
8.2. Персональные данные Пользователя никогда, ни\u00a0при каких условиях не\u00a0будут переданы третьим лицам, за\u00a0исключением случаев, связанных с\u00a0исполнением действующего законодательства либо в\u00a0случае, если субъектом персональных данных дано согласие Оператору на\u00a0передачу данных третьему лицу для исполнения обязательств по\u00a0гражданско-правовому договору. 
8.3. В\u00a0случае выявления неточностей в\u00a0персональных данных, Пользователь может актуализировать их\u00a0самостоятельно, путем направления Оператору уведомление на\u00a0адрес электронной почты Оператора admin@blow.ru с\u00a0пометкой «Актуализация персональных данных». 
8.4. Срок обработки персональных данных определяется достижением целей, для которых были собраны персональные данные, если иной срок не\u00a0предусмотрен договором или действующим законодательством.  Пользователь может в\u00a0любой момент отозвать свое согласие на\u00a0обработку персональных данных, направив Оператору уведомление посредством электронной почты на\u00a0электронный адрес Оператора admin@blow.ru с\u00a0пометкой «Отзыв согласия на\u00a0обработку персональных данных». 
12.1. Пользователь может получить любые разъяснения по\u00a0интересующим вопросам, касающимся обработки его персональных данных, обратившись к\u00a0Оператору с\u00a0помощью электронной почты admin@blow.ru. 
12.3. Актуальная версия Политики в\u00a0свободном доступе расположена в\u00a0сети Интернет по\u00a0адресу https://blow.ru/privacy/. 
12.3. Актуальная версия Политики в\u00a0свободном доступе расположена в\u00a0сети Интернет по\u00a0адресу https://kutumba.ru/privacy/. 
8.6. Установленные субъектом персональных данных запреты на\u00a0передачу (кроме предоставления доступа), а\u00a0также на\u00a0обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных для распространения, не\u00a0действуют в\u00a0случаях обработки персональных данных в\u00a0государственных, общественных и\u00a0иных публичных интересах, определенных законодательством\u00a0РФ. 
8.7. Оператор при обработке персональных данных обеспечивает конфиденциальность персональных данных. 
8.8. Оператор осуществляет хранение персональных данных в\u00a0форме, позволяющей определить субъекта персональных данных, не\u00a0дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не\u00a0установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по\u00a0которому является субъект персональных данных. 
8.9. Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных, отзыв согласия субъектом персональных данных или требование о\u00a0прекращении обработки персональных данных, а\u00a0также выявление неправомерной обработки персональных данных. 
9. Перечень действий, производимых Оператором с\u00a0полученными персональными данными 
9.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и\u00a0уничтожение персональных данных. 
9.2. Оператор осуществляет автоматизированную обработку персональных данных с\u00a0получением и/или\u00a0передачей полученной информации по\u00a0информационно-телекоммуникационным сетям или без таковой. 
10. Трансграничная передача персональных данных
10.1. Оператор до\u00a0начала осуществления деятельности по\u00a0трансграничной передаче персональных данных обязан уведомить уполномоченный орган по\u00a0защите прав субъектов персональных данных о\u00a0своем намерении осуществлять трансграничную передачу персональных данных (такое уведомление направляется отдельно от\u00a0уведомления о\u00a0намерении осуществлять обработку персональных данных). 
10.2. Оператор до\u00a0подачи вышеуказанного уведомления, обязан получить от\u00a0органов власти иностранного государства, иностранных физических лиц, иностранных юридических лиц, которым планируется трансграничная передача персональных данных, соответствующие сведения. 
11. Конфиденциальность персональных данных
Оператор и\u00a0иные лица, получившие доступ к\u00a0персональным данным, обязаны не\u00a0раскрывать третьим лицам и\u00a0не\u00a0распространять персональные данные без согласия субъекта персональных данных, если иное не\u00a0предусмотрено федеральным законом. 
12. Заключительные положения
12.1. Пользователь может получить любые разъяснения по\u00a0интересующим вопросам, касающимся обработки его персональных данных, обратившись к\u00a0Оператору с\u00a0помощью электронной почты admin@blow.ru. 
12.2. В\u00a0данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до\u00a0замены ее\u00a0новой версией. 
12.3. Актуальная версия Политики в\u00a0свободном доступе расположена в\u00a0сети Интернет по\u00a0адресу https://blow.ru/privacy/. 
`;

export default function PolicyPage() {
	return (
		<div className="min-h-screen flex flex-col justify-between">
			<div className="flex w-full flex-col px-3 md:px-9 pt-[84px] gap-6 pb-[50px]">
				<h1 className="text-[36px] font-semibold mt-3 sm:mt-9">Политики</h1>
				<div className="whitespace-pre-wrap text-sm sm:text-base space-y-4">
					{policyText}
				</div>
			</div>

			<footer className="bg-gray dark:bg-black w-full">
				<div className="bg-dark rounded-t-[50px] px-3 sm:px-12 py-[28px] grid grid-cols-1 sm:grid-cols-3 text-white items-center text-xs sm:text-base">
					<div className="sm:hidden flex justify-center">
						<Image
							alt="BLOW"
							height={40}
							radius="none"
							src="/logo.png"
							width={101}
						/>
					</div>
					<p className="text-center sm:twxt-left mt-5 sm:mt-0 text-xs">
						{new Date().getFullYear()} © BLOW
					</p>
					<div className="hidden sm:flex justify-center">
						<Image
							alt="BLOW"
							height={40}
							radius="none"
							src="/logo.png"
							width={101}
						/>
					</div>
					<div className="text-xs mt-7 sm:mt-0 flex flex-wrap items-center justify-center sm:justify-end gap-6">
						<NextLink
							className="underline cursor-pointer hover:text-primary text-nowrap"
							href={ROUTES.ARTICLES}
						>
							Статьи
						</NextLink>
						<NextLink
							href={ROUTES.CONTACTS}
							className="underline cursor-pointer hover:text-primary text-nowrap"
						>
							Свяжись с нами
						</NextLink>
						<NextLink
							href={ROUTES.POLICY}
							className="underline cursor-pointer hover:text-primary text-nowrap"
						>
							Политики
						</NextLink>
						<NextLink
							href={ROUTES.OFFER}
							className="underline cursor-pointer hover:text-primary text-nowrap"
						>
							Договор оферта
						</NextLink>
						<NextLink
              href={ROUTES.RULES}
              className="underline cursor-pointer hover:text-primary text-nowrap -mt-2 sm:mt-0"
            >
              Правила
            </NextLink>
					</div>
				</div>
			</footer>
		</div>
	);
}
